tutorials/pimpleHFDIBFoam/Immersed-SphereinCube-3D-Oscil/Embedded-Sphere-Oscillating/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rho             rho [1 -3 0 0 0 0 0] 1;
nu              nu  [0 2 -1 0 0 0 0] 0.03926990817;

// nu is calculated so that the Reynolds number is 20
// Re = Umax*D/nu = 20;
// Umax = 2*pi*h = 2*pi*D/8;
// Re = (2*pi*D/8)*D/nu = 20
// if D = 1, then
// 20 = (2*pi/8)/nu = pi/(4*nu);
// nu = pi/(4*20) = pi/80 = 0.03926990817

// ************************************************************************* //
