tutorials/pimpleHFDIBFoam/Immersed-SphereinCube-3D-Oscil/Embedded-Sphere-Oscillating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal|pcorr|pcorrFinal|cellDisplacement|cellDisplacementFinal"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.001;
        minIter         1;
        maxIter         100;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    nOuterCorrectors    30;
    nCorrectors         3;
    nNonOrthogonalCorrectors    1;

    pRefPoint   (0.75 0.0 0.0);
    pRefValue   0.0;

    moveMeshOuterCorrectors false;
    consistent  true;

    residualControl
    {
        p
        {
            tolerance 1e-6;
            relTol 0;
        }
        U
        {
            tolerance 1e-6;
            relTol 0;
        }
    }
}

relaxationFactors
{}

// ************************************************************************* //
